package Main;

public class Main {

    public static void main(String[] args) {
//        Создать классы Мужчин и Женщин, у которых есть общие характеристики (напр. рост, вес, цвет волос и тд).
//        Ограничить доступ к переменным извне - для доступа реализовать специальные getter-ы.
//        Определить для каждого класса, какие характеристики могут принадлежать классу,
//        а какие объекту, с поведением точно так же - какое поведение присуще классу,
//        а какое объекту - реализовать для каждого класса данную логику.
//        Создать демо класс для вывода результатов создания объектов на экран.

    }
}
